leetcode_329_longest_increasing_path_in_a_matrix.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 329. Longest Increasing Path in a Matrix</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 329. Longest Increasing Path in a Matrix</h1>
<p>
<a href="https://leetcode.com/problems/longest-increasing-path-in-a-matrix/">Problem Statement</a>: Given an matrix of integers, find the longest increase path in the matrix where the path contains only vertical and horizontal sections.
</p>

<div id="outline-container-orgc283b21" class="outline-2">
<h2 id="orgc283b21"><a href="topological_sort.html#ID-80122A2F-3B84-48B1-B10D-6ACEE4373298">Topological Sort</a></h2>
<div class="outline-text-2" id="text-orgc283b21">
<p>
By the problem's constraints, we should only consider going from a cell \((i, j)\) to \((x, y)\) if \((x, y)\) is adjacent to \((i, j)\) and its value is greater than the value of \((i, j)\).  In the following example, if we want to discover the biggest path that ends on 9 at \((0, 0)\), we must first find the longest paths ending on 6 \((0, 2)\) and 4 \((1, 0)\).  So, there is an order which the cells should be processed.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">9</td>
<td class="org-right">9</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-right">6</td>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>

<p>
<a href="pre_processing_the_input_can_make_easier_to_solve_the_original_problem.html#ID-42B21DBC-4951-4AF2-8C41-A646F5675365">Can we pre-process the input in a way to make easy to solve the problem?</a>  Given the cells ordered by their values, it is possible to compute the longest path ending on them by extending the longest paths that ended on their smaller neighbors (which by the order was already processed).
</p>

<p>
With \(N\) as the number of rows and \(M\) and number of columns,
</p>
<ul class="org-ul">
<li>time complexity: \(O(N \times (M + log(N)))\), and</li>
<li>space complexity: \(O(N \times M)\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List


<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">solve</span>(m):
    <span style="font-weight: bold; font-style: italic;">N</span> = <span style="font-weight: bold;">len</span>(m)
    <span style="font-weight: bold; font-style: italic;">M</span> = <span style="font-weight: bold;">len</span>(m[0])

    <span style="font-weight: bold; font-style: italic;">cells</span> = []
    <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N):
        <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(M):
            cells.append((m[i][j], i, j))
    <span style="font-weight: bold; font-style: italic;">cells</span> = <span style="font-weight: bold;">list</span>(<span style="font-weight: bold;">sorted</span>(cells))

    <span style="font-weight: bold; font-style: italic;">dp</span> = [[1] * M <span style="font-weight: bold;">for</span> _ <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N)]
    <span style="font-weight: bold; font-style: italic;">ans</span> = 1
    <span style="font-weight: bold;">for</span> v, i, j <span style="font-weight: bold;">in</span> cells:
        <span style="font-weight: bold;">for</span> di, dj <span style="font-weight: bold;">in</span> [(+0, +1), (+0, -1), (+1, +0), (-1, +0)]:
            <span style="font-weight: bold;">if</span> 0 &lt;= i + di &lt; N <span style="font-weight: bold;">and</span> 0 &lt;= j + dj &lt; M <span style="font-weight: bold;">and</span> m[i][j] &gt; m[i + di][j + dj]:
                dp[i][<span style="font-weight: bold; font-style: italic;">j</span>] = <span style="font-weight: bold;">max</span>(dp[i][j], 1 + dp[i + di][j + dj])
                <span style="font-weight: bold; font-style: italic;">ans</span> = <span style="font-weight: bold;">max</span>(ans, dp[i][j])
    <span style="font-weight: bold;">return</span> ans


<span style="font-weight: bold;">assert</span> solve([[9, 9, 4], [6, 6, 8], [2, 1, 1]]) == 4
<span style="font-weight: bold;">assert</span> solve([[3, 4, 5], [3, 2, 6], [2, 2, 1]]) == 4
<span style="font-weight: bold;">assert</span> solve([[1]]) == 1


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">longestIncreasingPath</span>(<span style="font-weight: bold;">self</span>, m: List[List[<span style="font-weight: bold;">int</span>]]) -&gt; <span style="font-weight: bold;">int</span>:
        <span style="font-weight: bold;">return</span> solve(m)
</pre>
</div>
</div>
</div>


<div id="outline-container-orgc4a2bc6" class="outline-2">
<h2 id="orgc4a2bc6">Cited by 2</h2>
<div class="outline-text-2" id="text-orgc4a2bc6">
<ul class="org-ul">
<li><a href="practice_005_leetcode_weekly_contest_300.html#ID-06853D2F-2827-4724-8C10-2993907099D9">Leetcode: 2328. Number of Increasing Paths in a Grid</a></li>
<li><a href="practice_020_leetcode.html#ID-932AB6F7-7985-445B-9BB0-9D6FB6E4E08C">Practice #020: Leetcode</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>